Tekla Open API Reference for Tekla Structures 2025
IResizeable.Resize Method
 Resizes the object to the specified size, overriding possible scaling settings.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
bool Resize(
	Size size
)
Function Resize (
	size As Size
) As Boolean
Parameters
size
Type: Tekla.Structures.Drawing.Size
The new size.
Return Value
Type: Boolean
True if succeeded.
See Also
Reference
IResizeable Interface
Tekla.Structures.Drawing Namespace